Public Attributes | List of all members
API_StoryCmdType Struct Reference
View Handling
Parameters of the change story settings command. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_StoryCmdID  | action
Action to be done in the Story Settings dialog.
short  | index
An existing story index, which the command is performed upon.
bool  | dispOnSections
The level line of the given story will or will not appear in any model window; in the case of APIStory_SetDispOnSections.
bool  | dontRebuild
Do not call rebuild or redraw after Go To Story command.
double  | height
Story height value; in the case of APIStory_SetHeight, APIStory_InsAbove, or APIStory_InsBelow commands.
double  | elevation
Story elevation value for APIStory_SetElevation.
GS::uchar_t  | uName [API_UniLongNameLen]
Story name for APIStory_InsAbove, APIStory_InsBelow, and APIStory_Rename.
Detailed Description
Parameters of the change story settings command.
Remarks
The command is related to an existing story. It must be referred by the index field of the structure. Possible operations are listed in the API_StoryCmdID list. Note, that in case story operations are disabled in team projects; except changing the active story. Note that story operations —except changing the active story— are disabled in teamwork projects.
Member Data Documentation
◆ action
 API_StoryCmdType::action
Action to be done in the Story Settings dialog.
◆ dispOnSections
 API_StoryCmdType::dispOnSections
The level line of the given story will or will not appear in any model window; in the case of APIStory_SetDispOnSections.
◆ dontRebuild
 API_StoryCmdType::dontRebuild
Do not call rebuild or redraw after Go To Story command.
◆ elevation
 API_StoryCmdType::elevation
Story elevation value for APIStory_SetElevation.
◆ height
 API_StoryCmdType::height
Story height value; in the case of APIStory_SetHeight, APIStory_InsAbove, or APIStory_InsBelow commands.
◆ index
 API_StoryCmdType::index
An existing story index, which the command is performed upon.
◆ uName
 API_StoryCmdType::uName
Story name for APIStory_InsAbove, APIStory_InsBelow, and APIStory_Rename.